# RbsElecRoomAverageIllumination Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecRoomAverageIllumination Property
ParameterTypeId Class See Also
---
"Average Estimated Illumination"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecRoomAverageIllumination { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecRoomAverageIllumination As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecRoomAverageIllumination {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace